<html>
<head>
    <title>The HTML Project</title>
    <link rel="icon"
          href="https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Logo_of_openIMIS.png/275px-Logo_of_openIMIS.png"
          type="image/x-icon" />
    <link href='https://fonts.googleapis.com/css?family=Anek Bangla' rel='stylesheet'>
    <style>
        body {
            font-family: 'Anek Bangla';
            font-size: 18px;
        }
    </style>
</head>
<body bgcolor=#BA3B46 text=#FFEEDB leftmargin=150 topmargin=25>
    <div align ="Right"><nav>
        <a style="color: #FFEEDB" href="./more.html" align = left>More info</a>
        &nbsp &nbsp &nbsp
        <a style="color: #FFEEDB" href="./contact.html" align = left>Contact Us</a>
    </nav></div>
    <center><big><h1>This is a story about Ranaghat</h1></big></center>
    <p align=left><b>Ranaghat</b> is a city and a municipality in Nadia district in the state of West Bengal, India. It is the headquarters of the Ranaghat subdivision.It is known for its handloom industry, various types of flowers and floriculture. Ranaghat has existed since the British invaded India. The most likely origin for the name of the town comes from Rani (Queen) or Rana (a Rajput warrior) and Ghat (steps leading to the river). A myth is still prevalent that the name of the town came from the bandit 'Rana Dacoit', who used to pillage this area five or six hundred years back and he used to give pujas to the goddess Kali to thank her.<br><br>&#2476;&#2480;&#2509;&#2468;&#2478;&#2494;&#2472;&#2503; <b>&#2480;&#2494;&#2467;&#2494;&#2456;&#2494;&#2463;</b> &#2472;&#2494;&#2478;&#2463;&#2495; &#2488;&#2476;&#2494;&#2439; &#2460;&#2494;&#2472;&#2482;&#2503;&#2451; &#2447;&#2439; &#2472;&#2494;&#2478;&#2453;&#2480;&#2467;&#2503;&#2480; &#2474;&#2486;&#2509;&#2458;&#2494;&#2468;&#2503; &#2447;&#2453;&#2494;&#2471;&#2495;&#2453; &#2478;&#2468;&#2494;&#2478;&#2468; &#2474;&#2494;&#2451;&#2479;&#2492;&#2494; &#2479;&#2494;&#2479;&#2492;&#2404; &#2453;&#2495;&#2459;&#2497; &#2453;&#2495;&#2459;&#2497; &#2439;&#2468;&#2495;&#2489;&#2494;&#2488;&#2476;&#2503;&#2468;&#2509;&#2468;&#2494;&#2470;&#2503;&#2480; &#2478;&#2468;&#2494;&#2472;&#2497;&#2488;&#2494;&#2480;&#2503;, &#2480;&#2494;&#2467;&#2494;&#2456;&#2494;&#2463;&#2503;&#2480; &#2474;&#2498;&#2480;&#2509;&#2476;&#2472;&#2494;&#2478; &#2459;&#2495;&#2482; &#2476;&#2509;&#2480;&#2489;&#2509;&#2478;&#2465;&#2494;&#2457;&#2494;&#2404; &#2458;&#2498;&#2480;&#2509;&#2467;&#2496; &#2472;&#2470;&#2496;&#2480; &#2468;&#2496;&#2480;&#2503; &#2437;&#2476;&#2488;&#2509;&#2469;&#2495;&#2468; &#2447;&#2439; &#2474;&#2509;&#2480;&#2494;&#2458;&#2496;&#2472; &#2460;&#2472;&#2474;&#2470;&#2503; &#2480;&#2472;&#2494; &#2476;&#2494; &#2480;&#2494;&#2472;&#2494; &#2472;&#2494;&#2478;&#2503; &#2447;&#2453; &#2465;&#2494;&#2453;&#2494;&#2468;&#2503;&#2480; &#2478;&#2498;&#2482; &#2456;&#2494;&#2433;&#2463;&#2495; &#2459;&#2495;&#2482;&#2404; &#2468;&#2494;&#2480; &#2477;&#2479;&#2492;&#2503; &#2438;&#2486;&#2503;&#2474;&#2494;&#2486;&#2503;&#2480; &#2455;&#2509;&#2480;&#2494;&#2478;&#2503;&#2480; &#2476;&#2494;&#2488;&#2495;&#2472;&#2509;&#2470;&#2494;&#2480;&#2494; &#2453;&#2494;&#2433;&#2474;&#2468;&#2404; &#2458;&#2498;&#2480;&#2509;&#2467;&#2496; &#2472;&#2470;&#2496;&#2468;&#2503; &#2479;&#2494;&#2468;&#2509;&#2480;&#2496; &#2451; &#2474;&#2467;&#2509;&#2479; &#2472;&#2495;&#2479;&#2492;&#2503; &#2468;&#2454;&#2472; &#2476;&#2465;&#2492;&#2507; &#2476;&#2465;&#2492;&#2507; &#2472;&#2508;&#2453;&#2494; &#2458;&#2482;&#2468;&#2404; &#2468;&#2476;&#2503; &#2480;&#2494;&#2472;&#2494;&#2480; &#2477;&#2479;&#2492;&#2503; &#2488;&#2476;&#2494;&#2439; &#2470;&#2482;&#2476;&#2470;&#2509;&#2471; &#2477;&#2494;&#2476;&#2503; &#2479;&#2503;&#2468;&#2404; &#2447;&#2439; &#2477;&#2479;&#2492;&#2503;&#2480; &#2453;&#2494;&#2480;&#2467;&#2503;&#2439; &#2476;&#2494;&#2488;&#2495;&#2472;&#2509;&#2470;&#2494;&#2480;&#2494; &#2476;&#2509;&#2480;&#2489;&#2509;&#2478;&#2465;&#2494;&#2457;&#2494;&#2453;&#2503; &#2438;&#2480; &#2476;&#2509;&#2480;&#2489;&#2509;&#2478;&#2465;&#2494;&#2457;&#2494; &#2476;&#2482;&#2468; &#2472;&#2494;&#2404; &#2476;&#2482;&#2468; &#2480;&#2494;&#2472;&#2494;&#2480; &#2465;&#2494;&#2453;&#2494;&#2468;&#2503;&#2480; &#2456;&#2494;&#2433;&#2463;&#2495; &#2476;&#2494; &#2480;&#2494;&#2472;&#2494;&#2480; &#2456;&#2494;&#2463;&#2404; &#2447;&#2439; &#2477;&#2494;&#2476;&#2503;&#2439; &#2476;&#2509;&#2480;&#2489;&#2509;&#2478;&#2465;&#2494;&#2457;&#2494; &#2489;&#2479;&#2492;&#2503; &#2455;&#2503;&#2482; <i>&#2480;&#2494;&#2467;&#2494;&#2456;&#2494;&#2463;</i><br><br>The town is inhabited mostly by Bengali Hindus. Durga-puja and Kali puja, like in all other Bengali communities, are the largest and most colourful festivals and are celebrated throughout the town. A Hindu festival called 'Dol yatra' is celebrated everywhere at the town. A village named 'Harinagar' is known for 'kirtan', a gathering of Hindu religious people in a motive to know God Krishna, is very popular. History of the ancient rath yatra of Ranaghat: The history of Pal-Chowdhury and De-Chowdhury is closely associated with the Rath Yatra of the ancient city of Ranaghat. The 3 ancient chariots of Ranaghat are in the hands of this dynasty.Two different dynasties of the Pal Chowdhury ratha yatra in different ways. One is Krishnapanti and the other is Shambhupanti. It is known from earlier accounts that Krishnapanti and Shambhupanti bought the village of Ranaghat on the banks of the river Churni at auction. Today's Ranaghat town is made up of different lands donated by them. Muslim community also present in court para. People from all ethnic/religious groups live together in a peaceful way and. The Christian community celebrates Christmas at Begopara Church outside the main township. During Christmas, people from all religions join the party. Moreover, there is a mosque at Nasra-para, on the outskirts of the town. Here people celebrate Eid, Durga Puja, Diwali and Christmas together.<br></p>
    <center><a href="https://www.ranaghatmunicipality.org/#/home" style="color: #FFEEDB" > <h3><strong> Ranaghat Municipality Website Link</strong> </h3><br></a></center>
    <center><img style="pointer-events:none;" src="https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Ranaghat_Junction_Railway_Station.jpeg/960px-Ranaghat_Junction_Railway_Station.jpeg" width=480 height=360 alt="A image of Ranaghat Railway Station" align=center><br>A image of Ranaghat Railway Station<br><br></center>
    <center><iframe style="pointer-events:none;" src="https://www.youtube-nocookie.com/embed/76pV_dwTdO0?vq=hd1080&autoplay=1&mute=1&loop=1&modestbranding=1&rel=0&iv_load_policy=3&fs=0&color=white&controls=0&disablekb=1&playlist=76pV_dwTdO0" width="560" height="266" title="Ranaghat Drone View." frameborder="0"></iframe></center>
    <center>A YouTube video showcasing ranaghat from drone-view.<br><br></center>
    <center><b>This page is created by - Realratnadwip</b>, on - 28/04/2024</center>
    <center>
        <iframe style="pointer-events:none;" src="https://free.timeanddate.com/clock/i9ckgzt0/n54/fn6/fs20/fcffeedb/tct/pct/ftb/pa8/tt0/tw1/th1/ta1/tb2" frameborder="0" width="380" height="41" allowtransparency="true"></iframe>
    </center>
</body>
</html>